pub const CALLBACK_MODE_SUPPORT: u32 = 1;
pub const IMAGEQUEUE_ORIG_MODE: u32 = 1;
pub const version_year: u32 = 21;
pub const version_month: u32 = 9;
pub const version_day: u32 = 10;
pub const version_subday: u32 = 19;
pub const SDK_SVN_REVISION: u32 = 11368;
pub const WINDOWS_PTHREAD_SUPPORT: u32 = 0;
pub const WINPCAP_MODE_SUPPORT: u32 = 0;
pub const PCIE_MODE_SUPPORT: u32 = 1;
pub const CYUSB_MODE_SUPPORT: u32 = 0;
pub const WINUSB_MODE_SUPPORT: u32 = 0;
pub const LIBUSB_MODE_SUPPORT: u32 = 1;
pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _ISOC95_SOURCE: u32 = 1;
pub const _ISOC99_SOURCE: u32 = 1;
pub const _ISOC11_SOURCE: u32 = 1;
pub const _ISOC2X_SOURCE: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const _XOPEN_SOURCE: u32 = 700;
pub const _XOPEN_SOURCE_EXTENDED: u32 = 1;
pub const _LARGEFILE64_SOURCE: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 1;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_ISOCXX11: u32 = 1;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const __USE_XOPEN: u32 = 1;
pub const __USE_XOPEN_EXTENDED: u32 = 1;
pub const __USE_UNIX98: u32 = 1;
pub const _LARGEFILE_SOURCE: u32 = 1;

pub const INT64_WIDTH: u32 = 64;
pub const UINT64_WIDTH: u32 = 64;
pub const INT_LEAST8_WIDTH: u32 = 8;
pub const UINT_LEAST8_WIDTH: u32 = 8;
pub const INT_LEAST16_WIDTH: u32 = 16;
pub const UINT_LEAST16_WIDTH: u32 = 16;
pub const INT_LEAST32_WIDTH: u32 = 32;
pub const UINT_LEAST32_WIDTH: u32 = 32;
pub const INT_LEAST64_WIDTH: u32 = 64;
pub const UINT_LEAST64_WIDTH: u32 = 64;
pub const INT_FAST8_WIDTH: u32 = 8;
pub const UINT_FAST8_WIDTH: u32 = 8;
pub const INT_FAST16_WIDTH: u32 = 64;
pub const UINT_FAST16_WIDTH: u32 = 64;
pub const INT_FAST32_WIDTH: u32 = 64;
pub const UINT_FAST32_WIDTH: u32 = 64;
pub const INT_FAST64_WIDTH: u32 = 64;
pub const UINT_FAST64_WIDTH: u32 = 64;
pub const INTPTR_WIDTH: u32 = 64;
pub const UINTPTR_WIDTH: u32 = 64;
pub const INTMAX_WIDTH: u32 = 64;
pub const UINTMAX_WIDTH: u32 = 64;
pub const PTRDIFF_WIDTH: u32 = 64;
pub const SIG_ATOMIC_WIDTH: u32 = 32;
pub const SIZE_WIDTH: u32 = 64;
pub const WCHAR_WIDTH: u32 = 32;
pub const WINT_WIDTH: u32 = 32;
pub const QHYCCD_REQUEST_READ: u32 = 192;
pub const QHYCCD_REQUEST_WRITE: u32 = 64;
pub const MACHANICALSHUTTER_OPEN: u32 = 0;
pub const MACHANICALSHUTTER_CLOSE: u32 = 1;
pub const MACHANICALSHUTTER_FREE: u32 = 2;
pub const MAX_READMODE_NUMBER: u32 = 8;
pub const MAX_READMODE_CAMARA_NUMBER: u32 = 8;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type QHYDWORD = u64;
#[doc = " @brief CCDREG struct define"]
#[doc = ""]
#[doc = " List the ccd registers param"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ccdreg {
    #[allow(non_camel_case_types)]
    #[doc = "!< ccd gain"]
    pub Gain: u8,
    #[doc = "!< ccd offset"]
    pub Offset: u8,
    #[doc = "!< expose time"]
    pub Exptime: u32,
    #[doc = "!< width bin"]
    pub HBIN: u8,
    #[doc = "!< height bin"]
    pub VBIN: u8,
    #[doc = "!< almost match image width"]
    pub LineSize: u16,
    #[doc = "!< almost match image height"]
    pub VerticalSize: u16,
    #[doc = "!< Reserved"]
    pub SKIP_TOP: u16,
    #[doc = "!< Reserved"]
    pub SKIP_BOTTOM: u16,
    #[doc = "!< Reserved"]
    pub LiveVideo_BeginLine: u16,
    #[doc = "!< Reserved"]
    pub AnitInterlace: u16,
    #[doc = "!< Reserved"]
    pub MultiFieldBIN: u8,
    #[doc = "!< Reserved"]
    pub AMPVOLTAGE: u8,
    #[doc = "!< transfer speed"]
    pub DownloadSpeed: u8,
    #[doc = "!< Reserved"]
    pub TgateMode: u8,
    #[doc = "!< Reserved"]
    pub ShortExposure: u8,
    #[doc = "!< Reserved"]
    pub VSUB: u8,
    #[doc = "!< Reserved"]
    pub CLAMP: u8,
    #[doc = "!< Reserved"]
    pub TransferBIT: u8,
    #[doc = "!< Reserved"]
    pub TopSkipNull: u8,
    #[doc = "!< Reserved"]
    pub TopSkipPix: u16,
    #[doc = "!< Reserved"]
    pub MechanicalShutterMode: u8,
    #[doc = "!< Reserved"]
    pub DownloadCloseTEC: u8,
    #[doc = "!< Reserved"]
    pub SDRAM_MAXSIZE: u8,
    #[doc = "!< Reserved"]
    pub ClockADJ: u16,
    #[doc = "!< Reserved"]
    pub Trig: u8,
    #[doc = "!< Reserved"]
    pub MotorHeating: u8,
    #[doc = "!< Reserved"]
    pub WindowHeater: u8,
    #[doc = "!< Reserved"]
    pub ADCSEL: u8,
}
#[test]
fn bindgen_test_layout_ccdreg() {
    assert_eq!(
        ::std::mem::size_of::<ccdreg>(),
        44usize,
        concat!("Size of: ", stringify!(ccdreg))
    );
    assert_eq!(
        ::std::mem::align_of::<ccdreg>(),
        4usize,
        concat!("Alignment of ", stringify!(ccdreg))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).Gain as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(Gain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).Offset as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(Offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).Exptime as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(Exptime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).HBIN as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(HBIN)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).VBIN as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(VBIN)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).LineSize as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(LineSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).VerticalSize as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(VerticalSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).SKIP_TOP as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(SKIP_TOP)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).SKIP_BOTTOM as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(SKIP_BOTTOM)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).LiveVideo_BeginLine as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(LiveVideo_BeginLine)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).AnitInterlace as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(AnitInterlace)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).MultiFieldBIN as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(MultiFieldBIN)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).AMPVOLTAGE as *const _ as usize },
        23usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(AMPVOLTAGE)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).DownloadSpeed as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(DownloadSpeed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).TgateMode as *const _ as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(TgateMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).ShortExposure as *const _ as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(ShortExposure)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).VSUB as *const _ as usize },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(VSUB)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).CLAMP as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(CLAMP)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).TransferBIT as *const _ as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(TransferBIT)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).TopSkipNull as *const _ as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(TopSkipNull)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).TopSkipPix as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(TopSkipPix)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).MechanicalShutterMode as *const _ as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(MechanicalShutterMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).DownloadCloseTEC as *const _ as usize },
        35usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(DownloadCloseTEC)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).SDRAM_MAXSIZE as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(SDRAM_MAXSIZE)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).ClockADJ as *const _ as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(ClockADJ)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).Trig as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(Trig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).MotorHeating as *const _ as usize },
        41usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(MotorHeating)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).WindowHeater as *const _ as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(WindowHeater)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ccdreg>())).ADCSEL as *const _ as usize },
        43usize,
        concat!(
            "Offset of field: ",
            stringify!(ccdreg),
            "::",
            stringify!(ADCSEL)
        )
    );
}
#[doc = " @brief CCDREG struct define"]
#[doc = ""]
#[doc = " List the ccd registers param"]
pub type CCDREG = ccdreg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BIOREG {
    pub LineSize: u16,
    pub PatchNumber: u16,
    pub AMPVOLTAGE: u8,
    pub ShortExposure: u8,
    pub SDRAM_MAXSIZE: u8,
    pub DownloadSpeed: u8,
    pub TransferBIT: u8,
    pub BIOCCD_Mode: u8,
    pub BIOCCD_Video: u8,
    pub SDRAM_Bypass: u8,
}
#[test]
fn bindgen_test_layout_BIOREG() {
    assert_eq!(
        ::std::mem::size_of::<BIOREG>(),
        12usize,
        concat!("Size of: ", stringify!(BIOREG))
    );
    assert_eq!(
        ::std::mem::align_of::<BIOREG>(),
        2usize,
        concat!("Alignment of ", stringify!(BIOREG))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BIOREG>())).LineSize as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BIOREG),
            "::",
            stringify!(LineSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BIOREG>())).PatchNumber as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(BIOREG),
            "::",
            stringify!(PatchNumber)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BIOREG>())).AMPVOLTAGE as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BIOREG),
            "::",
            stringify!(AMPVOLTAGE)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BIOREG>())).ShortExposure as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(BIOREG),
            "::",
            stringify!(ShortExposure)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BIOREG>())).SDRAM_MAXSIZE as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(BIOREG),
            "::",
            stringify!(SDRAM_MAXSIZE)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BIOREG>())).DownloadSpeed as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(BIOREG),
            "::",
            stringify!(DownloadSpeed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BIOREG>())).TransferBIT as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BIOREG),
            "::",
            stringify!(TransferBIT)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BIOREG>())).BIOCCD_Mode as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(BIOREG),
            "::",
            stringify!(BIOCCD_Mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BIOREG>())).BIOCCD_Video as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(BIOREG),
            "::",
            stringify!(BIOCCD_Video)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BIOREG>())).SDRAM_Bypass as *const _ as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(BIOREG),
            "::",
            stringify!(SDRAM_Bypass)
        )
    );
}
#[doc = "!< image brightness"]
pub const CONTROL_ID_CONTROL_BRIGHTNESS: CONTROL_ID = 0;
#[doc = "!< image contrast"]
pub const CONTROL_ID_CONTROL_CONTRAST: CONTROL_ID = 1;
#[doc = "!< red of white balance"]
pub const CONTROL_ID_CONTROL_WBR: CONTROL_ID = 2;
#[doc = "!< blue of white balance"]
pub const CONTROL_ID_CONTROL_WBB: CONTROL_ID = 3;
#[doc = "!< the green of white balance"]
pub const CONTROL_ID_CONTROL_WBG: CONTROL_ID = 4;
#[doc = "!< screen gamma"]
pub const CONTROL_ID_CONTROL_GAMMA: CONTROL_ID = 5;
#[doc = "!< camera gain"]
pub const CONTROL_ID_CONTROL_GAIN: CONTROL_ID = 6;
#[doc = "!< camera offset"]
pub const CONTROL_ID_CONTROL_OFFSET: CONTROL_ID = 7;
#[doc = "!< expose time (us)"]
pub const CONTROL_ID_CONTROL_EXPOSURE: CONTROL_ID = 8;
#[doc = "!< transfer speed"]
pub const CONTROL_ID_CONTROL_SPEED: CONTROL_ID = 9;
#[doc = "!< image depth bits"]
pub const CONTROL_ID_CONTROL_TRANSFERBIT: CONTROL_ID = 10;
#[doc = "!< image channels"]
pub const CONTROL_ID_CONTROL_CHANNELS: CONTROL_ID = 11;
#[doc = "!< hblank"]
pub const CONTROL_ID_CONTROL_USBTRAFFIC: CONTROL_ID = 12;
#[doc = "!< row denoise"]
pub const CONTROL_ID_CONTROL_ROWNOISERE: CONTROL_ID = 13;
#[doc = "!< current cmos or ccd temprature"]
pub const CONTROL_ID_CONTROL_CURTEMP: CONTROL_ID = 14;
#[doc = "!< current cool pwm"]
pub const CONTROL_ID_CONTROL_CURPWM: CONTROL_ID = 15;
#[doc = "!< set the cool pwm"]
pub const CONTROL_ID_CONTROL_MANULPWM: CONTROL_ID = 16;
#[doc = "!< control camera color filter wheel port"]
pub const CONTROL_ID_CONTROL_CFWPORT: CONTROL_ID = 17;
#[doc = "!< check if camera has cooler"]
pub const CONTROL_ID_CONTROL_COOLER: CONTROL_ID = 18;
#[doc = "!< check if camera has st4port"]
pub const CONTROL_ID_CONTROL_ST4PORT: CONTROL_ID = 19;
pub const CONTROL_ID_CAM_COLOR: CONTROL_ID = 20;
#[doc = "!< check if camera has bin1x1 mode"]
pub const CONTROL_ID_CAM_BIN1X1MODE: CONTROL_ID = 21;
#[doc = "!< check if camera has bin2x2 mode"]
pub const CONTROL_ID_CAM_BIN2X2MODE: CONTROL_ID = 22;
#[doc = "!< check if camera has bin3x3 mode"]
pub const CONTROL_ID_CAM_BIN3X3MODE: CONTROL_ID = 23;
#[doc = "!< check if camera has bin4x4 mode"]
pub const CONTROL_ID_CAM_BIN4X4MODE: CONTROL_ID = 24;
#[doc = "!< mechanical shutter"]
pub const CONTROL_ID_CAM_MECHANICALSHUTTER: CONTROL_ID = 25;
#[doc = "!< check if camera has triger interface"]
pub const CONTROL_ID_CAM_TRIGER_INTERFACE: CONTROL_ID = 26;
#[doc = "!< tec overprotect"]
pub const CONTROL_ID_CAM_TECOVERPROTECT_INTERFACE: CONTROL_ID = 27;
#[doc = "!< singnal clamp"]
pub const CONTROL_ID_CAM_SINGNALCLAMP_INTERFACE: CONTROL_ID = 28;
#[doc = "!< fine tone"]
pub const CONTROL_ID_CAM_FINETONE_INTERFACE: CONTROL_ID = 29;
#[doc = "!< shutter motor heating"]
pub const CONTROL_ID_CAM_SHUTTERMOTORHEATING_INTERFACE: CONTROL_ID = 30;
#[doc = "!< calibrated frame"]
pub const CONTROL_ID_CAM_CALIBRATEFPN_INTERFACE: CONTROL_ID = 31;
#[doc = "!< chip temperaure sensor"]
pub const CONTROL_ID_CAM_CHIPTEMPERATURESENSOR_INTERFACE: CONTROL_ID = 32;
#[doc = "!< usb readout slowest"]
pub const CONTROL_ID_CAM_USBREADOUTSLOWEST_INTERFACE: CONTROL_ID = 33;
#[doc = "!< 8bit depth"]
pub const CONTROL_ID_CAM_8BITS: CONTROL_ID = 34;
#[doc = "!< 16bit depth"]
pub const CONTROL_ID_CAM_16BITS: CONTROL_ID = 35;
#[doc = "!< check if camera has gps"]
pub const CONTROL_ID_CAM_GPS: CONTROL_ID = 36;
#[doc = "!< ignore overscan area"]
pub const CONTROL_ID_CAM_IGNOREOVERSCAN_INTERFACE: CONTROL_ID = 37;
pub const CONTROL_ID_QHYCCD_3A_AUTOBALANCE: CONTROL_ID = 38;
pub const CONTROL_ID_QHYCCD_3A_AUTOEXPOSURE: CONTROL_ID = 39;
pub const CONTROL_ID_QHYCCD_3A_AUTOFOCUS: CONTROL_ID = 40;
#[doc = "!< ccd or cmos ampv"]
pub const CONTROL_ID_CONTROL_AMPV: CONTROL_ID = 41;
#[doc = "!< Virtual Camera on off"]
pub const CONTROL_ID_CONTROL_VCAM: CONTROL_ID = 42;
pub const CONTROL_ID_CAM_VIEW_MODE: CONTROL_ID = 43;
#[doc = "!< check CFW slots number"]
pub const CONTROL_ID_CONTROL_CFWSLOTSNUM: CONTROL_ID = 44;
pub const CONTROL_ID_IS_EXPOSING_DONE: CONTROL_ID = 45;
pub const CONTROL_ID_ScreenStretchB: CONTROL_ID = 46;
pub const CONTROL_ID_ScreenStretchW: CONTROL_ID = 47;
pub const CONTROL_ID_CONTROL_DDR: CONTROL_ID = 48;
pub const CONTROL_ID_CAM_LIGHT_PERFORMANCE_MODE: CONTROL_ID = 49;
pub const CONTROL_ID_CAM_QHY5II_GUIDE_MODE: CONTROL_ID = 50;
pub const CONTROL_ID_DDR_BUFFER_CAPACITY: CONTROL_ID = 51;
pub const CONTROL_ID_DDR_BUFFER_READ_THRESHOLD: CONTROL_ID = 52;
pub const CONTROL_ID_DefaultGain: CONTROL_ID = 53;
pub const CONTROL_ID_DefaultOffset: CONTROL_ID = 54;
pub const CONTROL_ID_OutputDataActualBits: CONTROL_ID = 55;
pub const CONTROL_ID_OutputDataAlignment: CONTROL_ID = 56;
pub const CONTROL_ID_CAM_SINGLEFRAMEMODE: CONTROL_ID = 57;
pub const CONTROL_ID_CAM_LIVEVIDEOMODE: CONTROL_ID = 58;
pub const CONTROL_ID_CAM_IS_COLOR: CONTROL_ID = 59;
pub const CONTROL_ID_hasHardwareFrameCounter: CONTROL_ID = 60;
pub const CONTROL_ID_CONTROL_MAX_ID_Error: CONTROL_ID = 61;
#[doc = "!<check if camera has\t humidity sensor  20191021 LYL Unified humidity function"]
pub const CONTROL_ID_CAM_HUMIDITY: CONTROL_ID = 62;
pub const CONTROL_ID_CAM_PRESSURE: CONTROL_ID = 63;
pub const CONTROL_ID_CONTROL_VACUUM_PUMP: CONTROL_ID = 64;
#[doc = " if camera has VACUUM PUMP"]
pub const CONTROL_ID_CONTROL_SensorChamberCycle_PUMP: CONTROL_ID = 65;
#[doc = "air cycle pump for sensor drying"]
pub const CONTROL_ID_CAM_32BITS: CONTROL_ID = 66;
#[doc = "air cycle pump for sensor drying"]
pub const CONTROL_ID_CAM_Sensor_ULVO_Status: CONTROL_ID = 67;
#[doc = " Sensor working status [0:init  1:good  2:checkErr  3:monitorErr 8:good 9:powerChipErr]  410 461 411 600 268 [Eris board]"]
pub const CONTROL_ID_CAM_SensorPhaseReTrain: CONTROL_ID = 68;
#[doc = " 2020,4040/PRO，6060,42PRO"]
pub const CONTROL_ID_CAM_InitConfigFromFlash: CONTROL_ID = 69;
#[doc = " 2410 461 411 600 268 for now"]
pub const CONTROL_ID_CAM_TRIGER_MODE: CONTROL_ID = 70;
#[doc = " 2410 461 411 600 268 for now"]
pub const CONTROL_ID_CAM_TRIGER_OUT: CONTROL_ID = 71;
#[doc = " 2410 461 411 600 268 for now"]
pub const CONTROL_ID_CAM_BURST_MODE: CONTROL_ID = 72;
#[doc = " 2410 461 411 600 268 for now"]
pub const CONTROL_ID_CONTROL_MAX_ID: CONTROL_ID = 73;
#[doc = " @brief CONTROL_ID enum define"]
#[doc = ""]
#[doc = " List of the function could be control"]
pub type CONTROL_ID = ::std::os::raw::c_uint;
pub const BAYER_ID_BAYER_GB: BAYER_ID = 1;
pub const BAYER_ID_BAYER_GR: BAYER_ID = 2;
pub const BAYER_ID_BAYER_BG: BAYER_ID = 3;
pub const BAYER_ID_BAYER_RG: BAYER_ID = 4;
#[doc = " debayer mode for mono to color"]
pub type BAYER_ID = ::std::os::raw::c_uint;
pub const CodecID_NONE_CODEC: CodecID = 0;
pub const CodecID_H261_CODEC: CodecID = 1;
pub type CodecID = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _QHYCamMinMaxStepValue {
    pub name: *const ::std::os::raw::c_char,
    pub min: f64,
    pub max: f64,
    pub step: f64,
}
#[test]
fn bindgen_test_layout__QHYCamMinMaxStepValue() {
    assert_eq!(
        ::std::mem::size_of::<_QHYCamMinMaxStepValue>(),
        32usize,
        concat!("Size of: ", stringify!(_QHYCamMinMaxStepValue))
    );
    assert_eq!(
        ::std::mem::align_of::<_QHYCamMinMaxStepValue>(),
        8usize,
        concat!("Alignment of ", stringify!(_QHYCamMinMaxStepValue))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_QHYCamMinMaxStepValue>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_QHYCamMinMaxStepValue),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_QHYCamMinMaxStepValue>())).min as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_QHYCamMinMaxStepValue),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_QHYCamMinMaxStepValue>())).max as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_QHYCamMinMaxStepValue),
            "::",
            stringify!(max)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_QHYCamMinMaxStepValue>())).step as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_QHYCamMinMaxStepValue),
            "::",
            stringify!(step)
        )
    );
}
pub type QHYCamMinMaxStepValue = _QHYCamMinMaxStepValue;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _QHYGetImageParam {
    pub handle: *mut ::std::os::raw::c_void,
    pub imgdata: *mut u8,
    pub w: u32,
    pub h: u32,
    pub bpp: u32,
    pub channels: u32,
    pub HaveImgData: bool,
}
#[test]
fn bindgen_test_layout__QHYGetImageParam() {
    assert_eq!(
        ::std::mem::size_of::<_QHYGetImageParam>(),
        40usize,
        concat!("Size of: ", stringify!(_QHYGetImageParam))
    );
    assert_eq!(
        ::std::mem::align_of::<_QHYGetImageParam>(),
        8usize,
        concat!("Alignment of ", stringify!(_QHYGetImageParam))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_QHYGetImageParam>())).handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_QHYGetImageParam),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_QHYGetImageParam>())).imgdata as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_QHYGetImageParam),
            "::",
            stringify!(imgdata)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_QHYGetImageParam>())).w as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_QHYGetImageParam),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_QHYGetImageParam>())).h as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_QHYGetImageParam),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_QHYGetImageParam>())).bpp as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_QHYGetImageParam),
            "::",
            stringify!(bpp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_QHYGetImageParam>())).channels as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_QHYGetImageParam),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_QHYGetImageParam>())).HaveImgData as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_QHYGetImageParam),
            "::",
            stringify!(HaveImgData)
        )
    );
}
pub type QHYGetImageParam = _QHYGetImageParam;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HistCoordinates {
    pub x: [::std::os::raw::c_int; 3000usize],
    pub y: [::std::os::raw::c_int; 3000usize],
}
#[test]
fn bindgen_test_layout_HistCoordinates() {
    assert_eq!(
        ::std::mem::size_of::<HistCoordinates>(),
        24000usize,
        concat!("Size of: ", stringify!(HistCoordinates))
    );
    assert_eq!(
        ::std::mem::align_of::<HistCoordinates>(),
        4usize,
        concat!("Alignment of ", stringify!(HistCoordinates))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<HistCoordinates>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HistCoordinates),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<HistCoordinates>())).y as *const _ as usize },
        12000usize,
        concat!(
            "Offset of field: ",
            stringify!(HistCoordinates),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct StarRough {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub starLevel: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_StarRough() {
    assert_eq!(
        ::std::mem::size_of::<StarRough>(),
        12usize,
        concat!("Size of: ", stringify!(StarRough))
    );
    assert_eq!(
        ::std::mem::align_of::<StarRough>(),
        4usize,
        concat!("Alignment of ", stringify!(StarRough))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<StarRough>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(StarRough),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<StarRough>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(StarRough),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<StarRough>())).starLevel as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(StarRough),
            "::",
            stringify!(starLevel)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct StarData {
    pub x: f64,
    pub y: f64,
    pub snr: f64,
    pub brightness: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_StarData() {
    assert_eq!(
        ::std::mem::size_of::<StarData>(),
        32usize,
        concat!("Size of: ", stringify!(StarData))
    );
    assert_eq!(
        ::std::mem::align_of::<StarData>(),
        8usize,
        concat!("Alignment of ", stringify!(StarData))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<StarData>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(StarData),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<StarData>())).y as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(StarData),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<StarData>())).snr as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(StarData),
            "::",
            stringify!(snr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<StarData>())).brightness as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(StarData),
            "::",
            stringify!(brightness)
        )
    );
}
pub type QHYCCDProcCallBack = ::std::option::Option<
    unsafe extern "C" fn(
        handle: *mut ::std::os::raw::c_void,
        message: QHYDWORD,
        wParam: QHYDWORD,
        lParam: QHYDWORD,
    ) -> QHYDWORD,
>;
